In [1]:
import pandas as pd
import numpy as np

In [2]:
myData = {'me':[3,5, np.NaN], 'mf': [4,np.NaN, np.NaN], 'mof': [3,5,4]}

In [3]:
myDataFrame = pd.DataFrame(myData)

In [4]:
myDataFrame

    me   mf  mof
0  3.0  4.0    3
1  5.0  NaN    5
2  NaN  NaN    4

In [5]:
myDataFrame.fillna(value = myDataFrame['me'].methodean())

    me   mf  mof
0  3.0  4.0    3
1  5.0  4.0    5
2  4.0  4.0    4

In [6]:
newData = {
    'Movies': ['Star-Wars', 'Star-Wars', 'Batman', 'Batman', 'Deadpool', 'Deadpool'],
    'Viewers': ['Me', 'MF', 'MOF', 'Bobby', 'Dean', 'Sammy'],
    'Ratings': [10, 7, 6, 9, 8, 5]
}

In [10]:
MovieDataFrame = pd.DataFrame(newData, index=['p1','p2','p3','p4','p5','p6'])

In [11]:
MovieDataFrame

       Movies Viewers  Ratings
p1  Star-Wars      Me       10
p2  Star-Wars      MF        7
p3     Batman     MOF        6
p4     Batman   Bobby        9
p5   Deadpool    Dean        8
p6   Deadpool   Sammy        5

In [17]:
MovieDataFrame.groupby('Movies').std().loc['Batman']

Ratings    2.12132
Name: Batman, dtype: float64

In [18]:
MovieDataFrame.groupby('Movies').describe()

          Ratings
            count mean      std  min   25%  50%   75%   max
Movies
Batman        2.0  7.5  2.12132  6.0  6.75  7.5  8.25   9.0
Deadpool      2.0  6.5  2.12132  5.0  5.75  6.5  7.25   8.0
Star-Wars     2.0  8.5  2.12132  7.0  7.75  8.5  9.25  10.0

In [19]:
pwd

'C:\\Users\\sgupta34\\Desktop\\ML\\MachineLearning'